app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
    {
        // dd($request->all());
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'tenant' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $tenant = Tenant::firstOrCreate([
            'name' => $request->tenant
        ]);
        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'tenant_id' => $tenant->id
        ]);
---
insert into `tenants` (`name`, `updated_at`, `created_at`) values ('Aut quia quia quis u', '2026-07-18 16:51:36', '2026-07-18 16:51:36')
select * from `tenants` where (`name` = 'Aut quia quia quis u') limit 1
insert into `users` (`name`, `email`, `password`, `tenant_id`, `updated_at`, `created_at`) values ('Lael Lewis', 'syfyfu@mailinator.com', '$2y$12$EslIor7mFvO4feI.MlW.iu7W75Mm0QwWiLZbLdnGl0Y0BXlmJFR2C', 3, '2026-07-18 16:51:36', '2026-07-18 16:51:36')